Repository: eurolinux-enterprise-linux-sources/recode
Catalog: src/i18n/*.po
Languages: pl

source: No error
pl: Brak b³êdu

source: Non canonical input
pl: Dane wej¶ciowe nie s± kanoniczne

source: Ambiguous output
pl: Dane wyj¶ciowe s± dwuznaczne

source: Untranslatable input
pl: Dane wej¶ciowe nie mog± byæ przet³umaczone

source: Invalid input
pl: B³êdne dane wej¶ciowe

source: System detected problem
pl: System wykry³ problem

source: Misuse of recoding library
pl: B³êdne u¿ycie biblioteki przekodowuj±cej

source: Internal recoding bug
pl: Wyst±pi³ wewnêtrzny b³±d przekodowania

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
pl: Ten program jest darmowy; mo¿esz rozprowadzaæ go i/lub modyfikowaæ zachowuj±c warunki Powszechnej Licencji Publicznej GNU (General Public Licence), opublikowanej przez Free Software Foundation, w wersji 2 lub wy¿szej. Program ten jest rozprowadzany w nadziei, ¿e bêdzie przydatny, ale BEZ ¯ADNEJ GWARANCJI, nawet bez domy¶lnej gwarancji SPRZEDAWALNO¦CI lub PRZYDATNO¦CI DO KONKRETNYCH ZASTOSOWAÑ. Szczegó³y znajdziesz w Powszechnej Licencji Publicznej GNU. Powiniene¶ otrzymaæ kopiê Powszechnej Licencji Publicznej GNU wraz z tym programem. Je¶li nie, napisz do Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: Try `%s %s' for more information.
pl: Polecenie `%s %s' wy¶wietli wiêcej informacji.

source: Free `recode' converts files between various character sets and surfaces.
pl: Program `recode' konwertuje pliki pomiêdzy ró¿nymi zestawami znaków i sposobami kodowania.

source: Usage: %s [OPTION]... [ [CHARSET] | REQUEST [FILE]... ]
pl: Sk³adnia: %s [OPCJA]... [ [ZESTAW_ZNAKÓW] | POLECENIE [PLIK]... ]

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
pl: Je¶li argumenty s± obowi±zkowe dla d³ugich wersji opcji, to s± one równie¿ obowi±zkowe dla krótkich wersji. Analogicznie dla argumentów opcjonalnych.

source: Operation modes: -v, --verbose explain sequence of steps and report progress -q, --quiet, --silent inhibit messages about irreversible recodings -f, --force force recodings even when not reversible -t, --touch touch the recoded files after replacement -i, --sequence=files use intermediate files for sequencing passes --sequence=memory use memory buffers for sequencing passes
pl: Tryby pracy: -v, --verbose oznajmia wykonywane kroki oraz postêp pracy -q, --quiet, --silent nie wy¶wietla komunikatów o nieistotnych konwersjach -f, --force wymusza przekodowanie nawet je¶li jest ono nieodwracalne -t, --touch uaktualnia czas plików po przekodowaniu -i, --sequence=pliki u¿ywa plików tymczasowych miêdzy etapami --sequence=memory u¿ywa buforów w pamiêci miêdzy etapami

source: -p, --sequence=pipe use pipe machinery for sequencing passes
pl: -p, --sequence=pipe u¿ywa potoków miêdzy etapami

source: -p, --sequence=pipe same as -i (on this system)
pl: -p, --sequence=pipe identyczne jak -i (w tym systemie)

source: Fine tuning: -s, --strict use strict mappings, even loose characters -d, --diacritics convert only diacritics or alike for HTML/LaTeX -S, --source[=LN] limit recoding to strings and comments as for LN -c, --colons use colons instead of double quotes for diaeresis -g, --graphics approximate IBMPC rulers by ASCII graphics -x, --ignore=CHARSET ignore CHARSET while choosing a recoding path
pl: Modyfikacja parametrów pracy: -s, --strict u¿ywa ¶cis³ego mapowania, nawet dla nie¶cis³ych znaków -d, --diacritics konwertuje tylko znaki diakrytyczne oraz symbole znaków (takie jak w HTML i LaTeX) -c, --colons u¿ywa dwukropków zamiast cudzys³owów dla oznaczenia umlautu -g, --graphics próbuje przybli¿aæ ramki IBMPC znakami ASCII -x, --ignore=ZESTAW ignoruje ZESTAW znaków podczas okre¶lania drogi przekodowania

source: Option -l with no FORMAT nor CHARSET list available charsets and surfaces. FORMAT is `decimal', `octal', `hexadecimal' or `full' (or one of `dohf').
pl: Bez FORMATu lub ZESTAWu, opcja -l wy¶wietla dostêpne zestawy i sposoby kodowania znaków. FORMAT to `decimal', `octal', `hexadecimal' lub `full', (lub jedna z liter `dohf').

source: With -k, possible before charsets are listed for the given after CHARSET, both being tabular charsets, with PAIRS of the form `BEF1:AFT1,BEF2:AFT2,...' and BEFs and AFTs being codes are given as decimal numbers.
pl: Je¶li podano opcjê -k, program wy¶wietla zestawy znaków z których mo¿na dokonaæ konwersji do podanego ZESTAWu docelowego. Oba s± stabelaryzowanymi zestawami znaków z PARAmi postaci `SK¡D1:DOK¡D1,SK¡D2:DOK¡D2...', gdzie SK¡D i DOK¡D s± kodami podanymi jako liczby dziesiêtne.

source: LN is some language, it may be `c', `perl' or `po'; `c' is the default.
pl: LN jest jêzykiem programowania, do wyboru `c', `perl' lub `po'. Domy¶ln± warto¶ci± jest `c'.

source: REQUEST is SUBREQUEST[,SUBREQUEST]...; SUBREQUEST is ENCODING[..ENCODING]... ENCODING is [CHARSET][/[SURFACE]]...; REQUEST often looks like BEFORE..AFTER, with BEFORE and AFTER being charsets. An omitted CHARSET implies the usual charset; an omitted [/SURFACE]... means the implied surfaces for CHARSET; a / with an empty surface name means no surfaces at all. See the manual.
pl: POLecenie to PODPOL[,PODPOL]...; PODPOLecenie to ENKOD[..ENKOD]... ENKOD to [ZESTAW][/[KODOWANIE]]...; POLecenie czêsto ma postaæ SK¡D..DOK¡D, gdzie SK¡D i DOK¡D s± zestawami znaków. W miejsce pominiêtego zestawu przyjmowany jest zestaw domy¶lny; W miejsce pominiêtego [/KODOWANIA] przyjmowany jest domy¶lny sposób kodowania dla danego ZESTawu; sam znak / bez podanego KODOWANIA oznacza brak jakiegokolwiek kodowania. Szczegó³y w dokumentacji.

source: If none of -i and -p are given, presume -p if no FILE, else -i. Each FILE is recoded over itself, destroying the original. If no FILE is specified, then act as a filter and recode stdin to stdout.
pl: Je¶li nie podano opcji -i ani -p, przyjmowana jest opcja -p je¶li nie podano PLIKu, w przeciwnym razie -i. Ka¿dy PLIK jest nadpisywany z utrat± oryginalnej zawarto¶ci. Je¶li nie podano PLIKu, program dzia³a jako filtr przekodowuj±c stdin na stdout.

source: Report bugs to <recode-bugs@iro.umontreal.ca>.
pl: Prosimy o zg³aszanie b³êdów na adres <recode-bugs@iro.umontreal.ca>.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
pl: Oprogramowanie darmowe; warunki jego kopiowania znajdziesz w kodzie ¼ród³owym. Nie podlega ¿adnej gwarancji, nawet gwarancji przydatno¶ci do jakiegokolwiek zastosowania lub sprzeda¿y.

source: Recoding %s...
pl: Przekodowanie %s...

source: done
pl: skoñczone

source: Charset %s already exists and is not %s
pl: Zestaw %s ju¿ istnieje i nie jest %s

source: Cannot list `%s', no names available for this charset
pl: Nie mogê wylistowaæ `%s', brak nazw dla tego zestawu znaków

source: Dec Oct Hex UCS2 Mne %s
pl: Dec Okt Hex UCS2 Mne %s

source: Sorry, no names available for `%s'
pl: Brak nazw dla `%s'

source: Resurfacer set more than once for `%s'
pl: Procedura rekoduj±ca zosta³a ustawiona wiêcej ni¿ raz dla `%s'

source: Unsurfacer set more than once for `%s'
pl: Procedura dekoduj±ca zosta³a ustawiona wiêcej ni¿ raz dla `%s'

source: Virtual memory exhausted
pl: Pamiêæ wirtualna wyczerpana

source: Codes %3d and %3d both recode to %3d
pl: Kody %3d i %3d oba t³umacz± siê na %3d

source: No character recodes to %3d
pl: ¯aden znak nie koduje siê na %3d

source: Cannot invert given one-to-one table
pl: Nie mogê odwróciæ danej tablicy

source: Following diagnostics for `%s' to `%s'
pl: Diagnostyka dla `%s' do `%s'

source: Pair no. %d: <%3d, %3d> conflicts with <%3d, %3d>
pl: Para nr %d: < %3d, %3d > konflikt z < %3d, %3d >

source: Cannot complete table from set of known pairs
pl: Nie mogê utworzyæ tablicy z zestawu znanych par

source: Identity recoding, not worth a table
pl: Przekodowanie jest proste, tablica nie jest potrzebna

source: Recoding is too complex for a mere table
pl: Przekodowanie jest zbyt skomplikowane na zwyk³± tablicê

source: %sConversion table generated mechanically by Free `%s' %s
pl: %sTablica przekodowañ wygenerowana automatycznie przez GNU `%s' %s.

source: %sfor sequence %s.%s
pl: %sdla sekwencji %s.%s

source: No table to print
pl: Brak tablicy do wypisania

source: reversible
pl: odwracalna

source: %s to %s
pl: %s na %s

source: byte
pl: bajt

source: variable
pl: zmienne

source: *Unachievable*
pl: *Nieosi±galne*

source: *mere copy*
pl: *zwyk³a kopia*

source: Virtual memory exhausted!
pl: Pamiêæ wirtualna wyczerpana!

source: Step initialisation failed
pl: Inicjalizacja kroku nie powiod³a siê

source: Step initialisation failed (unprocessed options)
pl: Inicjalizacja kroku nie powiod³a siê (nieprzetworzone opcje)

source: Request: %s
pl: Polecenie: %s

source: Shrunk to: %s
pl: Zmniejszony do: %s

source: Unrecognised surface name `%s'
pl: Nierozpoznana nazwa standardu kodowania `%s'

source: No way to recode from `%s' to `%s'
pl: Przekodowanie `%s' na `%s' jest niemo¿liwe

source: Expecting `..' in request
pl: Spodziewane `..' w poleceniu

source: Child process wait status is 0x%0.2x
pl: Stan oczekiwania procesu potomnego wynosi 0x%0.2x
